option8 = {
    backgroundColor: '#000',
    globe: {
        // 地图纹理
        show: true,
        baseTexture: '../images/earth.jpg',
        shading: 'lambert',
        // 地图背景
        environment: '../images/earthbackground.jpg',
        atmosphere: {
            show: true,
        },
        viewControl: {
            targetCoord: [0, 10],
        },
        //color模式下light不作用
        light: {
            ambient: {
                //环境光强度
                intensity: 0.7,
            },
            main: {
                //主光源强度
                intensity: 0.3,
            },
        },
    },
    series: [
        {
        type: 'lines3D',
        coordinateSystem: 'globe',
        blendMode: 'lighter',
        lineStyle: {
            normal: {
                opacity: 1,
                color: "#00FEFF",
                width: 1,
            },
        },
        effect: {
            show: true,
            period: 4, //特效动画的时间，单位为 s
            trailLength: 0.2, //特效尾迹的长度。0~1数值越大尾迹越长
            color: "#64f2ff",
            symbol: "arrow", //箭头图标
            symbolSize: 10, //图标大小
        },
        data: [
            {
                coords: [
                    [121.4737, 31.23041, 100], //上海
                    [117.150024, 39.114174, 100], //天津
                ]
            },
            {
                coords: [
                    [126.9780, 37.5665], //首尔的经纬度坐标
                    [121.4737, 31.23041, 100], //上海
                ]
            },
            {
                coords: [
                    [116.4074, 39.9042, 100], //北京
                    [139.6917, 35.6895, 100], //东京
                ]
            },
            {
                coords: [
                    [-0.1276, 51.5074, 100], //伦敦
                    [2.3522, 48.8566, 100], //巴黎
                ]
            },
            {
                coords: [
                    [-118.2437, 34.0522], //洛杉矶的经纬度坐标
                    [-74.005972, 40.712776], //纽约的经纬度坐标
                ]
            },
            {
                coords: [
                    [-0.1276, 51.5074], //伦敦的经纬度坐标
                    [12.4964, 41.9028], //罗马的经纬度坐标
                ]
            },
            {
                coords: [
                    [-0.1276, 51.5074], //伦敦的经纬度坐标
                    [37.6173, 55.7558], //莫斯科的经纬度坐标
                ]
            },
            {
                coords: [
                    [55.2708, 25.2048], //迪拜的经纬度坐标
                    [77.2090, 28.6139], //新德里的经纬度坐标
                ]
            },
            {
                coords: [
                    [55.2708, 25.2048], //迪拜的经纬度坐标
                    [37.6173, 55.7558], //莫斯科的经纬度坐标
                ]
            },
            {
                coords: [
                    [12.4964, 41.9028], //罗马的经纬度坐标
                    [37.6173, 55.7558], //莫斯科的经纬度坐标
                ]
            },
            {
                coords: [
                    [12.4964, 41.9028], //罗马的经纬度坐标
                    [55.2708, 25.2048], //迪拜的经纬度坐标
                ]
            },
            {
                coords: [
                    [37.6173, 55.7558], //莫斯科的经纬度坐标
                    [77.2090, 28.6139], //新德里的经纬度坐标
                ]
            },
            {
                coords: [
                    [12.4964, 41.9028], //罗马的经纬度坐标
                    [77.2090, 28.6139], //新德里的经纬度坐标
                ]
            },
            {
                coords: [
                    [116.4074, 39.9042, 100], //北京
                    [77.2090, 28.6139], //新德里的经纬度坐标
                ]
            },
            {
                coords: [
                    [116.4074, 39.9042, 100], //北京
                    [37.6173, 55.7558], //莫斯科的经纬度坐标
                ]
            },
            {
                coords: [
                    [121.4737, 31.23041, 100], //上海
                    [77.2090, 28.6139], //新德里的经纬度坐标
                ]
            },
            {
                coords: [
                    [103.8198, 1.3521], //新加坡的经纬度坐标
                    [77.2090, 28.6139], //新德里的经纬度坐标
                ]
            },
            {
                coords: [
                    [103.8198, 1.3521], //新加坡的经纬度坐标
                    [121.4737, 31.23041, 100], //上海
                ]
            },
            {
                coords: [
                    [103.8198, 1.3521], //新加坡的经纬度坐标
                    [102.7123, 25.0406, 100], //昆明
                ]
            },
            {
                coords: [
                    [77.2090, 28.6139], //新德里的经纬度坐标
                    [102.7123, 25.0406, 100], //昆明
                ]
            },
            {
                coords: [
                    [121.4737, 31.23041, 100], //上海
                    [102.7123, 25.0406, 100], //昆明
                ]
            },
            {
                coords: [
                    [80.7718, 7.8731, 100], //斯里兰卡
                    [77.2090, 28.6139], //新德里的经纬度坐标
                ]
            },
            {
                coords: [
                    [80.7718, 7.8731, 100], //斯里兰卡
                    [55.2708, 25.2048], //迪拜的经纬度坐标
                ]
            },
            {
                coords: [
                    [80.7718, 7.8731, 100], //斯里兰卡
                    [103.8198, 1.3521], //新加坡的经纬度坐标
                ]
            },
            {
                coords: [
                    [12.4964, 41.9028], //罗马的经纬度坐标
                    [31.2357, 30.0444], //开罗的经纬度坐标
                ]
            },
            {
                coords: [
                    [55.2708, 25.2048], //迪拜的经纬度坐标
                    [31.2357, 30.0444], //开罗的经纬度坐标
                ]
            },
            {
                coords: [
                    [121.4737, 31.23041, 100], //上海
                    [139.6917, 35.6895, 100], //东京
                ]
            },
            {
                coords: [
                    [80.7718, 7.8731, 100], //斯里兰卡
                    [102.7123, 25.0406, 100], //昆明
                ]
            },
            {
                coords: [
                    [-0.1276, 51.5074], //伦敦的经纬度坐标
                    [-74.005972, 40.712776], //纽约的经纬度坐标
                ]
            }],
        silent: false
    },
        {
            type: 'scatter3D',
            coordinateSystem: 'globe',
            blendMode: 'lighter',
            symbolSize: 8,
            itemStyle: {
                color: 'red', // 将标记点设置为红色
                opacity: 1
            },
            data: [{
                value: [116.4074, 39.90421], // 北京的经纬度坐标
                name:'北京',
                description: '一号地面站'
            },{
                value: [139.6917, 35.6895], //东京的经纬度坐标
                name:'东京',
                description: '二号地面站'
            },{
                value: [-0.1276, 51.5074], //伦敦的经纬度坐标
                name:'伦敦',
                description: '三号地面站'
            },{
                value: [121.4737, 31.23041], //上海的经纬度坐标
                name:'上海',
                description: '四号地面站'
            },{
                value: [-74.005972, 40.712776], //纽约的经纬度坐标
                name:'纽约',
                description: '五号地面站'
            },{
                value: [2.3522, 48.8566], //巴黎的经纬度坐标
                name:'巴黎',
                description: '六号地面站'
            },{
                value: [37.6173, 55.7558], //莫斯科的经纬度坐标
                name:'莫斯科',
                description: '七号地面站'
            },{
                value: [55.2708, 25.2048], //迪拜的经纬度坐标
                name:'迪拜',
                description: '八号地面站'
            },{
                value: [77.2090, 28.6139], //新德里的经纬度坐标
                name:'新德里',
                description: '九号地面站'
            },{
                value: [151.2093, -33.8688], //悉尼的经纬度坐标
                name:'悉尼',
                description: '十号地面站'
            },{
                value: [12.4964, 41.9028], //罗马的经纬度坐标
                name:'罗马',
                description: '十一号地面站'
            },{
                value: [126.9780, 37.5665], //首尔的经纬度坐标
                name:'首尔',
                description: '十二号地面站'
            },{
                value: [103.8198, 1.3521], //新加坡的经纬度坐标
                name:'新加坡',
                description: '十三号地面站'
            },{
                value: [-118.2437, 34.0522], //洛杉矶的经纬度坐标
                name:'洛杉矶',
                description: '十四号地面站'
            },{
                value: [151.2093, -33.8688], //里约热内卢的经纬度坐标
                name:'里约热内卢',
                description: '十五号地面站'
            },{
                value: [102.7123, 25.0406], //昆明的经纬度坐标
                name:'昆明',
                description: '十六号地面站'
            },{
                value: [28.9784, 41.0082], //伊斯坦布尔的经纬度坐标
                name:'伊斯坦布尔',
                description: '十七号地面站'
            },{
                value: [31.2357, 30.0444], //开罗的经纬度坐标
                name:'开罗',
                description: '十八号地面站'
            },{
                value: [80.7718, 7.8731], //斯里兰卡的经纬度坐标
                name:'斯里兰卡',
                description: '十九号地面站'
            }],
            silent: false
        }],
    tooltip: {
        z:999,
        // 在提示框中显示名称和描述信息
        formatter: function (params) {
            if (params.componentType === 'series' && params.seriesType === 'scatter3D') {
                var data = params.data;
                if (data) {
                    var name = data.name;
                    var description = data.description;
                    return '名称：' + name + '<br>' + '描述：' + description;
                }
            }
            return '';
        }
    }
};